app/controllers/airframes_controller.rb

UPDATE "airframes" SET "name" = ?, "weight" = ?, "config" = ?, "image" = ? WHERE "airframes"."id" = ?  [["name", "Updated Airframe Name"], ["weight", 1000], ["config", 1], ["image", "update.url.com"], ["id", 1]]
---
  def update
    airframe = Airframe.find_by(id: params[:id])
    airframeData = {
      name: params[:java_script_name],
      weight: params[:java_script_weight],
      config: params[:java_script_config],
      image: params[:java_script_image]
    }
      airframe.update(airframeData)