app/controllers/airframes_controller.rb

SELECT "airframes".* FROM "airframes"
---
  def index
    airframes = Airframe.all

SELECT "attitudes".* FROM "attitudes" WHERE "attitudes"."airframe_id" = ? LIMIT ?  [["airframe_id", 2], ["LIMIT", 1]]
SELECT "pids".* FROM "pids" WHERE "pids"."airframe_id" = ? LIMIT ?  [["airframe_id", 2], ["LIMIT", 1]]
SELECT "plugins".* FROM "plugins" WHERE "plugins"."airframe_id" = ? LIMIT ?  [["airframe_id", 2], ["LIMIT", 1]]
DELETE FROM "airframes" WHERE "airframes"."id" = ?  [["id", 2]]
DELETE FROM "attitudes" WHERE "attitudes"."id" = ?  [["id", 2]]
DELETE FROM "pids" WHERE "pids"."id" = ?  [["id", 2]]
DELETE FROM "plugins" WHERE "plugins"."id" = ?  [["id", 2]]
---
  def destroy
    airframe = Airframe.find_by(:id => params[:id])

    # Whenever the airframe gets deleted, its associated classes also get deleted.
    # In the future, parameters may be shared between airframes but not for now.
    airframeAttitude = Attitude.find_by(:airframe_id => params[:id])
    airframePid = Pid.find_by(:airframe_id => params[:id])
    airframePlugin = Plugin.find_by(:airframe_id => params[:id])
    if airframe.present?
      Airframe.destroy(airframe.id)

      # Whenever the airframe gets deleted, its associated classes also get deleted.
      # In the future, parameters may be shared between airframes but not for now.
      Attitude.destroy(airframeAttitude.id)
      Pid.destroy(airframePid.id)
      Plugin.destroy(airframePlugin.id)