app/controllers/airframes_controller.rb

  def index
    # airframes = Airframe.all

    # to make this as efficient as possible, we only need to grab the name and id
    # since we are not displaing airframe details all at once, since we have
    # each airframe on a seperate route in the current configuration.
    airframes = Airframe.select(:name, :id)
---
SELECT "airframes"."name", "airframes"."id" FROM "airframes"

  def show
    airframe = Airframe.find_by(id: params[:id])
---
SELECT "airframes".* FROM "airframes" WHERE "airframes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    airframeData = {
      name: params[:java_script_name],
      weight: params[:java_script_weight],
      config: params[:java_script_config],
      image: params[:java_script_image]
    }
    new_airframe = Airframe.create(airframeData)
    new_attitude = Attitude.create(
      airframe_id: new_airframe.id,
      lim_roll_cd:39,
      lim_pitch_max: 32,
      lim_pitch_min: -24
    )


    new_pid = Pid.create(airframe_id: new_airframe.id)
    new_plugin = Plugin.create(airframe_id: new_airframe.id)
---
INSERT INTO "airframes" ("name", "weight", "config", "image") VALUES (?, ?, ?, ?)  [["name", "A"], ["weight", 2], ["config", "1"], ["image", "url.com"]]
INSERT INTO "attitudes" ("lim_roll_cd", "lim_pitch_max", "lim_pitch_min", "airframe_id") VALUES (?, ?, ?, ?)  [["lim_roll_cd", 39], ["lim_pitch_max", 32], ["lim_pitch_min", -24], ["airframe_id", 28]]
INSERT INTO "pids" ("airframe_id") VALUES (?)  [["airframe_id", 28]]
INSERT INTO "plugins" ("airframe_id") VALUES (?)  [["airframe_id", 28]]

  def update
    airframe = Airframe.find_by(id: params[:id])
    airframeData = {
      name: params[:java_script_name],
      weight: params[:java_script_weight],
      config: params[:java_script_config],
      image: params[:java_script_image]
    }
      airframe.update(airframeData)
---
SELECT "airframes".* FROM "airframes" WHERE "airframes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "airframes" SET "name" = ?, "weight" = ?, "config" = ? WHERE "airframes"."id" = ?  [["name", "F-14B Tomcat"], ["weight", 4], ["config", "Twin Boom"], ["id", 15]]

  def destroy
    airframe = Airframe.find_by(:id => params[:id])

    # Whenever the airframe gets deleted, its associated classes also get deleted.
    # In the future, parameters may be shared between airframes but not for now.
    airframeAttitude = Attitude.find_by(:airframe_id => params[:id])
    airframePid = Pid.find_by(:airframe_id => params[:id])
    airframePlugin = Plugin.find_by(:airframe_id => params[:id])
    if airframe.present?
      Airframe.destroy(airframe.id)

      # Whenever the airframe gets deleted, its associated classes also get deleted.
      # In the future, parameters may be shared between airframes but not for now.
      Attitude.destroy(airframeAttitude.id)
      Pid.destroy(airframePid.id)
      Plugin.destroy(airframePlugin.id)
---
SELECT "airframes".* FROM "airframes" WHERE "airframes"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
SELECT "attitudes".* FROM "attitudes" WHERE "attitudes"."airframe_id" = ? LIMIT ?  [["airframe_id", 27], ["LIMIT", 1]]
SELECT "pids".* FROM "pids" WHERE "pids"."airframe_id" = ? LIMIT ?  [["airframe_id", 27], ["LIMIT", 1]]
SELECT "plugins".* FROM "plugins" WHERE "plugins"."airframe_id" = ? LIMIT ?  [["airframe_id", 27], ["LIMIT", 1]]
DELETE FROM "airframes" WHERE "airframes"."id" = ?  [["id", 27]]
DELETE FROM "attitudes" WHERE "attitudes"."id" = ?  [["id", 27]]
DELETE FROM "pids" WHERE "pids"."id" = ?  [["id", 27]]
DELETE FROM "plugins" WHERE "plugins"."id" = ?  [["id", 27]]