app/controllers/attitudes_controller.rb

SELECT "attitudes".* FROM "attitudes"
---
  def index
    attitudes = Attitude.all

SELECT "attitudes".* FROM "attitudes" WHERE "attitudes"."airframe_id" = ? LIMIT ?  [["airframe_id", 1], ["LIMIT", 1]]
---
  def show
    attitude = Attitude.find_by(airframe_id: params[:id])

SELECT "attitudes".* FROM "attitudes" WHERE "attitudes"."airframe_id" = ? LIMIT ?  [["airframe_id", nil], ["LIMIT", 1]]
UPDATE "attitudes" SET "lim_roll_cd" = ?, "lim_pitch_max" = ?, "lim_pitch_min" = ? WHERE "attitudes"."id" = ?  [["lim_roll_cd", 27], ["lim_pitch_max", 22], ["lim_pitch_min", -12], ["id", 1]]
---
  def update
    attitude = Attitude.find_by(airframe_id: params[:id])
    attitudeData = {
      lim_roll_cd: params[:java_script_lim_roll_cd],
      lim_pitch_max: params[:java_script_lim_pitch_max],
      lim_pitch_min: params[:java_script_lim_pitch_min]
    }
      attitude.update(attitudeData)