app/controllers/attitudes_controller.rb

SELECT "attitudes".* FROM "attitudes" WHERE "attitudes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    attitude = Attitude.find_by(id: params[:id])