app/controllers/pids_controller.rb

SELECT "pids".* FROM "pids"
---
  def index
    pids = Pid.all

SELECT "pids".* FROM "pids" WHERE "pids"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    pid = Pid.find_by(id: params[:id])