app/controllers/plugins_controller.rb

  def index
    plugins = Plugin.all
---
SELECT "plugins".* FROM "plugins"